{
  "summary": "Proactive .NET Core developer with 5 years of experience in building scalable web applications, cloud solutions, and game development. Passionate about optimizing performance and delivering innovative software solutions.",
  "skills": {
    "programming": "C#, SQL, Typescript, HTML5, CSS3",
    "backendWeb":"ASP.Net Core (MVC | Web API), React, Bootstrap",
    "cloudServices": "AWS (SQS, Lambda), Docker",
    "database": "Microsoft SQL server 16+, PostgreSQL",
    "designPatterns":"Dependency Injection, Microservices, Domain-Driven Design",
    "productivityTools": "Entity Framework, xUnit, .Net CLI, LINQ, Git, Jenkins CI/CD"
  },
  "professionalExperience": [
    {
      "jobTitle": "Junior Software Developer",
      "companyName": "SashasTrends Inc – Waterloo, ON",
      "duration": "July 2024 – Mar 2025",
      "productName": "Sashas Trends.com (C#|.Net Core 7):",
      "projectDescription": [
        "Engineered a .Net Core MVC Content Management System utilizing patterns such as Dependency Injection (DI) to dynamically manage contents where content managers update the product in the database.",
        "Collaborated with senior developers to build a highly scalable .NET Core 7 backend Web APIs with Entity Framework Core and MS-SQL Server to serve react application with authentication and authorization enabled.",
        "Developed using Test-Driven Development (TDD) approach writing test cases using xUnit with coverage of 80% and documenting design for each production release, facilitating knowledge sharing across the organization.",
        "Contributed to employing React SPA to craft a responsive and smooth client interface, integrating Redux for centralized state management and REST APIs for efficient and faster data fetching, reducing bounce rates. ",
        "Designed database in SQL Server 2016 and created stored procedures, functions, and views to reduce the complication of front-end SQL Queries and triggers to enforce entity relationships."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"web",
          "linkName": "Full Stack",
          "linkDesc": "Website",
          "linkUrl": "https://www.sashastrends.com/?srsltid=AfmBOops79KvCiIa98meta95JZZ3hrBqBGT-LIK5LZeI54X84SIpaSVA"
        }
      ]
    },
    {
      "jobTitle": "Software Developer",
      "companyName": "VGMinds TechStudio – Bangalore, India",
      "duration": "Dec 2019 – Oct 2022",
      "productName": "Kidzooly Games (C#|Unity3D)",
      "projectDescription": [
        "Developed casual games using Unity engine, creating KIDSAFE gameplay experience with features like activities, in-app purchases, parental control, rewards system, ads, and secure-encrypted video playback.",
        "Contributed to game play feature implementing state machine, internal game-wide event system, quest system, game mechanics and UI implementation, backend support maintaining large database running SQL server and .Net Core 6.",
        "Delivered a dynamic content delivery system using Rest APIs and JSON, packaging and updating the contents of the app without to update the physical app binary with coverage of 90%.",
        "Implemented optimisation techniques like object pooling, slicing, atlases, LODs, occlusions, and reducing GC usage by avoiding temporary allocations on every frame, string mutations and endorsing value types across application."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon": "web",
          "linkName": "Kidzooly",
          "linkDesc": "ABC Songs and Nursery Rhymes",
          "linkUrl": "https://play.google.com/store/apps/details?id=kidzooly.rhymes"
        },{
          "linkType": "url",
          "icon": "web",
          "linkName": "Tabby Too",
          "linkDesc": "Kids Learning Game",
          "linkUrl": "https://play.google.com/store/apps/details?id=com.kidzooly.tinytoo"
        }
      ]
    },
    {
      "jobTitle": "Software Developer",
      "companyName": "Gboom Software Pvt.Ltd – Chennai",
      "duration": "May 2017 – Jun 2019",
      "productName": "Casual Games",
      "projectDescription": [
        "Crafted intricate run-time asset management system with asset bundles that dynamically updates the game elements reducing build size by 90% that are mapped by application version built for different mobile platforms.",
        "Implemented multiple distributed systems such as network, asset management, backend CMS, users, profiles, inventory management, quest services that are decoupled and employing unit tests cases for all of them.",
        "Developed an open world game and contributed to quests engine, NPC AI, microservices, economy, inventory management, runtime asset management, user session and optimizing render pipelines, memory, resulting in 45% performance gain.",
        "Experienced with a full life cycle of software development- SDLC: use cases, requirements, high-level design, low-level design, implementation and writing unit test cases and avoiding concrete dependency using abstractions."
      ]
    }
  ],
  "personalProjects": [
    {
      "projectName": "Book Shop Project",
      "projectDescription": [
        "Developed SQL Server database project tailored for Book reservations, executing CRUD operations, designing reusable views, and orchestrating intricate queries, column-store indexing, stored procedures, and aggregate and scalar functions ensuring reusability of queries up to 80%.",
        "Boosted the performance of the reservations system database by implementing indexing techniques and optimizing schema design with both clustered and non-clustered indexes, resulting in a remarkable 40% increase in efficiency, as evidenced by improved query execution times."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"github",
          "linkName": "GitHub Repo",
          "linkDesc": "Bulky book",
          "linkUrl": "https://github.com/ramya-krishnasamy/bulky"
        }
      ]
    }
  ],
  "education": [
    {
      "courseName": "Conestoga College",
      "collegeName": "Information Technology and Business Analysis",
      "duration": "Jan 2023 - Apr 2024",
      "courseDescription": [
        "Mastering BI tools to create statistical analysis, data mining and predictive modelling to derive meaningful insights from the dataset by connecting to data source, preparing, aggregating, creating interactive dashboards, stories, and forecasting trends while maintaining security.",
        "Upgrading database knowledge on MS-SQL Server by building database for e-commerce platform and optimising by indexing, normalizing for reducing redundancy, de-normalizing to reduce extra joins and tracking performance in query store resulting in performance gain of 35%.",
        "Spearheaded capstone as Project Manager with 5 team members to understand and improve business architecture of RBC breaking down financial and business fundamentals by elicitation tools like observation, brainstorming, workshops potentially improving 15% in productivity.",
        "Orchestrated proficiency in programming languages in Python, SQL to realize data warehouse (ETL) concepts like Data extraction, Transformation, Storage, Retrieval and Analysis, meta data management using data manipulation libraries like Pandas and NumPy."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"data",
          "linkName": "Visualization",
          "linkDesc": "Tableau Public Live",
          "linkUrl": "https://public.tableau.com/app/profile/ramya.krishnasamy/viz/EmploymentRateinCanada/Story?publish=yes"
        },
        {
          "linkType": "url",
          "icon":"github",
          "linkName": "GitHub Repo",
          "linkDesc": "E-Commerce SQL Dataset",
          "linkUrl": "https://github.com/ramya-krishnasamy/ecommerce-datasql"
        }
      ]
    },
    {
      "courseName": "Anna University",
      "collegeName": "Computer Science and Engineering",
      "duration": "Aug 2010 - Apr 2014",
      "courseDescription": [
        "Commenced with strong fundamentals of computer science like Object-Oriented Programming and Data structure algorithms."
      ]
    }
  ],
  "certifications": [
    {
      "certificationDescription":"Microsoft SQL Server 2019 Essential Training",
      "icon":"linkedin",
      "certificationName": "CompTIA®",
      "certificationLink": "https://www.linkedin.com/learning/certificates/deae6968011f963d1f8016a28ce05d3b74f729339dbea41f8648b4cfabc0b57e?u=2212217"
    },{
      "certificationDescription":"Microsoft Certified Technology Specialist (MCTS)",
      "icon":"none",
      "certificationName": ".Net framework 4 C#",
      "certificationLink": "https://www.linkedin.com/learning/certificates/deae6968011f963d1f8016a28ce05d3b74f729339dbea41f8648b4cfabc0b57e?u=2212217"
    }
  ]
}
