{
  "summary": "Results-driven engineer with 4 years of research experience in Canada, specializing in electrochemical energy conversion systems for transportation, with proven success in cross-sector project leadership, advanced testing, and data-driven innovation in low-carbon technologies.",
  "skills": {
    "Electrochemical Systems": "PEM Fuel Cells, PEM Water Electrolyzers, Li-ion Batteries",
    "Characterization Techniques":"Potentiodynamic/Potentiostatic Polarization, EIS, LSV, CV, ICP-OES, SEM, EDX, TEM, XRD, XPS",
    "Prototyping & Instrumentation": "Protective Coatings, MEA Fabrication, Fuel Cell Test Station, Potentiostat (Gamry), Goniometer, Four-point probe, Transient Plane Source",
    "Programming & ML": "Python, MATLAB, Keras, TensorFlow, ANN, LSTM, XGB, Genetic Algorithm",
    "Modelling & Simulation":"Siemens NX, Ansys Fluent, COMSOL, MATLAB, SOLIDWORKS",
    "Hardware & Embedded Systems": "HDL for FPGA, VHDL, Intel Quartus, ModelSim",
    "Design of Experiments (DoE)": "Minitab, ANOVA, Regression Modelling, RSM"
  },
  "professionalExperience": [
    {
      "jobTitle": "Design and development of coated metallic bipolar plates for proton exchange membrane fuel cells",
      "companyName": "Precision Resource, Cambridge, ON – University of Waterloo, ON",
      "duration": "May 2022 – Present",
      "productName": "Nb-Ti Alloy/Pt Coated Metallic Bipolar Plates",
      "projectDescription": [
        "Improved corrosion resistance of SS316L by 2.5× at 25 °C and 0.5× at 80 °C, achieving 99.98% protective efficiency, exceeding DOE targets.",
        "Increased in-plane electrical conductivity by 42.6% and thermal conductivity by 3.5%, both surpassing DOE technical benchmarks.",
        "Decreased interfacial contact resistance (ICR) by 2.5× under 140 N/cm2 compaction, supporting compact and high-performance stack design.",
        "Enhanced hydrophobicity with larger surface contact angles, improving long-term water management and material stability."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"web",
          "linkName": "Link",
          "linkDesc": "Journal Article",
          "linkUrl": "https://doi.org/10.1016/j.enconman.2024.118536"
        }
      ]
    },
    {
      "jobTitle": "Software Developer",
      "companyName": "VGMinds TechStudio – Bangalore, India",
      "duration": "Dec 2019 – Oct 2022",
      "productName": "Kidzooly Games (C#|Unity3D)",
      "projectDescription": [
        "Developed casual games using Unity engine, creating KIDSAFE gameplay experience with features like activities, in-app purchases, parental control, rewards system, ads, and secure-encrypted video playback.",
        "Contributed to game play feature implementing state machine, internal game-wide event system, quest system, game mechanics and UI implementation, backend support maintaining large database running SQL server and .Net Core 6.",
        "Delivered a dynamic content delivery system using Rest APIs and JSON, packaging and updating the contents of the app without to update the physical app binary with coverage of 90%.",
        "Implemented optimisation techniques like object pooling, slicing, atlases, LODs, occlusions, and reducing GC usage by avoiding temporary allocations on every frame, string mutations and endorsing value types across application."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon": "web",
          "linkName": "Kidzooly",
          "linkDesc": "ABC Songs and Nursery Rhymes",
          "linkUrl": "https://play.google.com/store/apps/details?id=kidzooly.rhymes"
        },{
          "linkType": "url",
          "icon": "web",
          "linkName": "Tabby Too",
          "linkDesc": "Kids Learning Game",
          "linkUrl": "https://play.google.com/store/apps/details?id=com.kidzooly.tinytoo"
        }
      ]
    },
    {
      "jobTitle": "Software Developer",
      "companyName": "Gboom Software Pvt.Ltd – Chennai",
      "duration": "May 2017 – Jun 2019",
      "productName": "Casual Games",
      "projectDescription": [
        "Crafted intricate run-time asset management system with asset bundles that dynamically updates the game elements reducing build size by 90% that are mapped by application version built for different mobile platforms.",
        "Implemented multiple distributed systems such as network, asset management, backend CMS, users, profiles, inventory management, quest services that are decoupled and employing unit tests cases for all of them.",
        "Developed an open world game and contributed to quests engine, NPC AI, microservices, economy, inventory management, runtime asset management, user session and optimizing render pipelines, memory, resulting in 45% performance gain.",
        "Experienced with a full life cycle of software development- SDLC: use cases, requirements, high-level design, low-level design, implementation and writing unit test cases and avoiding concrete dependency using abstractions."
      ]
    }
  ],
  "personalProjects": [
    {
      "projectName": "Book Shop Project",
      "projectDescription": [
        "Developed SQL Server database project tailored for Book reservations, executing CRUD operations, designing reusable views, and orchestrating intricate queries, column-store indexing, stored procedures, and aggregate and scalar functions ensuring reusability of queries up to 80%.",
        "Boosted the performance of the reservations system database by implementing indexing techniques and optimizing schema design with both clustered and non-clustered indexes, resulting in a remarkable 40% increase in efficiency, as evidenced by improved query execution times."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"github",
          "linkName": "GitHub Repo",
          "linkDesc": "Bulky book",
          "linkUrl": "https://github.com/ramya-krishnasamy/bulky"
        }
      ]
    }
  ],
  "education": [
    {
      "courseName": "Conestoga College",
      "collegeName": "Information Technology and Business Analysis",
      "duration": "Jan 2023 - Apr 2024",
      "courseDescription": [
        "Mastering BI tools to create statistical analysis, data mining and predictive modelling to derive meaningful insights from the dataset by connecting to data source, preparing, aggregating, creating interactive dashboards, stories, and forecasting trends while maintaining security.",
        "Upgrading database knowledge on MS-SQL Server by building database for e-commerce platform and optimising by indexing, normalizing for reducing redundancy, de-normalizing to reduce extra joins and tracking performance in query store resulting in performance gain of 35%.",
        "Spearheaded capstone as Project Manager with 5 team members to understand and improve business architecture of RBC breaking down financial and business fundamentals by elicitation tools like observation, brainstorming, workshops potentially improving 15% in productivity.",
        "Orchestrated proficiency in programming languages in Python, SQL to realize data warehouse (ETL) concepts like Data extraction, Transformation, Storage, Retrieval and Analysis, meta data management using data manipulation libraries like Pandas and NumPy."
      ],
      "projectLink": [
        {
          "linkType": "url",
          "icon":"data",
          "linkName": "Visualization",
          "linkDesc": "Tableau Public Live",
          "linkUrl": "https://public.tableau.com/app/profile/ramya.krishnasamy/viz/EmploymentRateinCanada/Story?publish=yes"
        },
        {
          "linkType": "url",
          "icon":"github",
          "linkName": "GitHub Repo",
          "linkDesc": "E-Commerce SQL Dataset",
          "linkUrl": "https://github.com/ramya-krishnasamy/ecommerce-datasql"
        }
      ]
    },
    {
      "courseName": "Anna University",
      "collegeName": "Computer Science and Engineering",
      "duration": "Aug 2010 - Apr 2014",
      "courseDescription": [
        "Commenced with strong fundamentals of computer science like Object-Oriented Programming and Data structure algorithms."
      ]
    }
  ],
  "certifications": [
    {
      "certificationDescription":"Microsoft SQL Server 2019 Essential Training",
      "icon":"linkedin",
      "certificationName": "CompTIA®",
      "certificationLink": "https://www.linkedin.com/learning/certificates/deae6968011f963d1f8016a28ce05d3b74f729339dbea41f8648b4cfabc0b57e?u=2212217"
    },{
      "certificationDescription":"Microsoft Certified Technology Specialist (MCTS)",
      "icon":"none",
      "certificationName": ".Net framework 4 C#",
      "certificationLink": "https://www.linkedin.com/learning/certificates/deae6968011f963d1f8016a28ce05d3b74f729339dbea41f8648b4cfabc0b57e?u=2212217"
    }
  ]
}
